/* 
  Localized.strings
  Otto

  Created by labuser on 9/29/11.
  Copyright 2011 __MyCompanyName__. All rights reserved.
*/

// To create the following '.strings' entries from mac '.r' files,
// use the following regular exp search string 
// ^resource.*\((.*)\)\s*{\s*\"(.*)\"\s};
// and the replace string as "\1" = "\2";

"1400" = ""; //IDS_CAPTION                 1400
"1401" = ""; //IDS_ALERT_MESSAGE           1401    
"1409" = ""; //IDS_PLAYERERROR_TITLE       

"1403" = "Movies"; //IDS_MOVIE_SECTION           
"1404" = "Movie"; //IDS_MOVIE_STUB              

"1406" = "Palette"; //IDS_PALETTE_SECTION			
"1407" = "Animation"; //IDS_PALETTE_ANIMATE			
"1408" = "SystemFriendly"; //IDS_PALETTE_SYSTEM_FRIENDLY	

"1405" = "Settings"; //IDS_SETTINGS_SECTION        
"1450" = "EscapeOK"; //IDS_PERMIT_ESC              
"1451" = "LoopPlayList"; //IDS_LOOP_PLAYLIST           
"1452" = "FullScreen"; //IDS_FULL_SCREEN             
"1453" = "UseTitleBar"; //IDS_HAS_TITLE_BAR           
"1454" = "BackgroundAnimation"; //IDS_ANIMATE_IN_BACKGROUND   
"1455" = "SwitchColorDepth"; //IDS_SWITCH_COLOR_DEPTH      
"1456" = "CenterStage"; //IDS_CENTER_STAGE            
"1457" = "ResizeStage"; //IDS_RESIZE_STAGE            
"1460" = "MessageWindow"; //IDS_MESSAGE_WINDOW          
"1461" = "MessageWindowRect"; //IDS_MESSAGE_WINDOW_RECT     
"1467" = "SingleInstance"; //IDS_SINGLE_INSTANCE			

"1463" = "Memory"; //IDS_MEMORY_SECTION			
"1464" = "ExtraMainMemory"; //IDS_MEMORY_MAIN				
"1465" = "ExtraSecondaryMemory"; //IDS_MEMORY_SECONDARY		
"1466" = "UseSecondaryMemory"; //IDS_MEMORY_USE_SECONDARY	
"1468" = "SingleTaskbarEntry"; //IDS_SINGLE_TASKBAR_ENTRY	

"1500" = ""; //IDS_TIMEOUT                 
"1501" = ""; //IDS_PROJTERMINATING         
"1502" = ""; //IDS_TOCLOADERROR            
"1503" = ""; //IDS_MOVIELOADERROR          
"1504" = ""; //IDS_PLAYBACKERROR           
"1505" = ""; //IDS_BOGUS_PROJ_ERROR        
"1506" = ""; //IDS_CANNOT_QUEUE            
"1507" = ""; //IDS_TOOMANYERRORS           
"1508" = ""; //IDS_UNSUPPORTED_BITDEPTH	

"1512" = ""; //IDS_ERR_DOWNLOAD_FAIL		
"1513" = ""; //IDS_ERR_DOWNLOAD_WARN

//entries from dp/mmp/error.r
"50" = "MMP Error";
"51" = "MMP Error %d";
"0" = "No error.";
"-80" = "Error playing Director movie.";
"-90" = "Missing Shockwave Decompression XTRA";
"-103" = "File %s is protected and cannot be opened.";
"-111" = "Movie %s was created using a old version of Director.  Use Director version 7 and recompile all scripts.";
"-112" = "Movie %s cannot be loaded.  The file version is too new.";
"-113" = " is not a Director file.";
"-114" = ".";
"-115" = " because it is already open with write permission by another user.";
"-116" = "There was a disk read error while loading this movie.";
"-117" = "Sorry, this movie is damaged.  %s is corrupted.";
"-118" = "Sorry, this movie is damaged.  %s is corrupted.";
"-119" = "Unable to load %s because some font information is missing.  Please use Director to re-enter the text for this castmember.";
"-120" = "Sorry, this movie is damaged and cannot be loaded.";
"-121" = "There is an illegal castmember [%s] in this movie.";
"-122" = "Out of memory, even after purging all purgeable castmembers.";
"-123" = "Out of memory loading %s, even after purging all purgeable castmembers.";
"-124" = "Out of memory while saving %s.";
"-125" = "Out of memory while displaying a sprite, even after purging all purgeable castmembers.";
"-126" = "Problem reading compiled scripts. (%d)";
"-413" = "Out of memory.  Unable to create the offscreen buffer.";
"-414" = "This program is unable to run on your system.  Your screen bit depth of %d bits per pixel is not supported.";
"-428" = " could not be found.";
"-429" = "Sorry, this movie is damaged.  Could not find chunk: ChunkID='%4s', ResourceID=%04lx.";
"-430" = "Sorry, this movie is damaged.  Castmembers are missing.";
"-431" = "The sound data format in %s is unsupported.  Make sure compression is not being used.  The sound must be a type 2 SND resource.";
"-432" = "The sound data format in linked sound %s is unsupported.  Make sure compression is not being used.  Linked sounds must be in either AIFF or WAV format.";
"-435" = "This movie contains bitmap castmembers of an unsupported bit depth: %d bits per pixel.";
"-436" = "%s is not a linked castmember.  Use Director to reimport this cast as a linked cast.";
"-437" = "Could not find digital video movie file %s.";
"-438" = "Unable to play digital video movie file %s.  The file format is unsupported.";
"-439" = "Internal error: Unexpected failure while compositing bitmap %s.";
"-440" = "Internal error: Unexpected failure while compositing text %s.";
"-441" = "Internal error: Unexpected failure while saving the cast record for %s to movie.";
"-442" = "Problem drawing picture %s.";
"-450" = "Having trouble saving this movie.";
"-451" = "Unable to create the new movie file.";
"-452" = "Unable to save the movie because it is already open with write permission by another user.";
"-453" = "Unable to save this movie because the volume is full.";
"-454" = "An Xtra (%s) is required that either does not exist or failed to initialize properly.  Please make sure the appropriate Xtras are in the Xtras folder.";
"-455" = "The network Xtras either do not exist or failed to initialize properly.  Please make sure the appropriate Xtras are in the Xtras folder.";
"-457" = "User cancelled upgrade operation.";
"5200" = "A duplicate Xtra has been encountered in your Xtras folder(s).  Please quit and remove the duplicate to avoid a possible conflict.";
"5201" = "A duplicate Xtra has been encountered in your Xtras folder(s) (%s).  Please quit and remove the duplicate to avoid a possible conflict.";
"5202" = "This application requires an Xtra (%s) that either does not exist or failed to initialize properly.  Please make sure the appropriate Xtras are in the Xtras folder(s).";
"5203" = "No type symbol specified for an Xtra asset type.  Xtra registration failed.";
"5204" = "Invalid type symbol specified for an Xtra asset type (%s).  Xtra registration failed.";
"5205" = "No actor type specified for an Xtra asset type (%s).  Xtra registration failed.";
"5206" = "Invalid actor type specified for an Xtra asset type (%s).  Xtra registration failed.";
"5207" = "Xtra registration failed due to a memory error.";
"5208" = "An internal error occurred while registering Xtras.";
"5209" = "An Xtra has specified a type name which is already in use (%s).  Please quit and remove the Xtra to avoid a possible conflict.";
"5210" = "%s requires an Xtra (%s) that either does not exist or failed to initialize properly.";
"5211" = "Invalid display name specified for an Xtra asset type (%s).  Using asset type symbol instead.";

//entries from lingocore/resource/mac/llingo.r
"2001" = "Stopped by user";
"2002" = "Out of memory";
"2003" = "Out of memory for string";
"2004" = "Handler not defined";
"2005" = "Handler not found in object";
"2006" = "Cannot divide by zero";
"2007" = "Integer expected";
"2008" = "Number expected";
"2009" = "Floating point number expected";
"2010" = "String expected";
"2011" = "Symbol expected";
"2012" = "Object expected";
"2013" = "List expected";
"2014" = "Rect expected";
"2015" = "Point expected";
"2016" = "Cast member expected";
"2017" = "Media expected";
"2018" = "Picture expected";
"2019" = "Wrong type";
"2020" = "Zero parameters expected";
"2021" = "One parameter expected";
"2022" = "Two parameters expected";
"2023" = "Three parameters expected";
"2024" = "Four parameters expected";
"2025" = "Wrong number of parameters";
"2026" = "Method not defined";
"2027" = "Command not defined";
"2028" = "Function not defined";
"2029" = "This command not allowed in a method";
"2030" = "Message expected";
"2031" = "Too many parameters to an XObject";
"2032" = "Fault in ";
"2033" = "No XCOD resource for XObject";
"2034" = "XLib file not found";
"2035" = "Cast member not found";
"2036" = "Cast member name expected";
"2037" = "Not a field cast member";
"2038" = "Text style wrong";
"2039" = "Menu not defined";
"2040" = "Menu item not defined";
"2041" = "Frame not defined";
"2042" = "Sprite number wrong";
"2043" = "Accel option wrong";
"2044" = "Palette not defined";
"2045" = "Sound not defined";
"2046" = "Sound option wrong";
"2047" = "XCMD name expected";
"2048" = "Label expected";
"2049" = "Movie name expected";
"2050" = "Variable not defined";
"2051" = "Script wrong";
"2052" = "Not a digital video sprite";
"2053" = "Index too big";
"2054" = "Window not found";
"2055" = "Property not found";
"2056" = "Cannot perform TELL";
"2057" = "Cannot set this property";
"2058" = "At least 2 parameters expected";
"2059" = "Index is not positive";
"2060" = "Index out of range";
"2061" = "Value out of range";
"2062" = "List must contain integer";
"2063" = "List cannot be empty";
"2064" = "Integer or list expected";
"2065" = "Cast Member not a bitmap or not black and white";
"2066" = "XObject entry not found";
"2067" = "Script cast member not found";
"2068" = "XObject callback not supported";
"2069" = "Property or value missing";
"2070" = "More than 16 xobject parameters";
"2071" = "Factory name expected";
"2072" = "Movie cast not found ";
"2073" = "Too many parameters to Lingo Xtra";
"2074" = "Lingo Xtra handler requires instance";
"2075" = "Xtra not found";
"2076" = "Xtra name expected";
"2077" = "Xtra handler name expected";
"2078" = "Comma expected in Xtra interface";
"2079" = "Digital video cast member expected";
"2080" = "Digital video cast member not found";
"2081" = "Bitmap cast member not found";
"2082" = "Bitmap cast member expected";
"2083" = "Sound cast member not found";
"2084" = "Sound cast member expected";
"2085" = "Button cast member not found";
"2086" = "Button cast member expected";
"2087" = "Shape cast member not found";
"2088" = "Shape cast member expected";
"2089" = "Movie cast member not found";
"2090" = "Movie cast member expected";
"2091" = "Script cast member not found";
"2092" = "Script cast member expected";
"2093" = "Transition cast member expected";
"2094" = "Only field cast members can be used to create menus";
"2095" = "Too many symbols";
"2096" = "File can not be closed since xtras are in use";
"2097" = "Error";
"2098" = "File read error";
"2099" = "File error";
"2100" = "Script syntax error";
"2101" = "Script runtime error";
"2102" = "Use of unsupported Lingo command";
"2103" = "Incorrect preference file extension";
"2104" = "Can not interrupt script";
"2105" = "Color expected";
"2106" = "List expected for handler ";
"2107" = "Property list expected for handler ";
"2108" = "Access not supported ";
"2109" = "Property reference expected ";
"2110" = "Incorrect behavior initializer. (Periods are not allowed in symbols) ";
"2111" = "Cast member is not on disk yet (streaming is not complete)";
"2112" = "Too many nested handler calls ";
"2113" = "Operation disabled";
"2114" = "Image expected";
"2115" = "Object with duplicate name already exists";
"2116" = "Object has been deleted";
"2117" = "Invalid point";
"2118" = "Invalid vector";
"2119" = "Vector expected";
"2120" = "Matrix expected";
"2121" = "Invalid parameter";
"2122" = "File not found";
"2123" = "Media not ready";
"2124" = "Unknown symbol";
"2125" = "SoundObject Already Exists";
"2126" = "End of ByteArray reached";
/* ---------------------------------------------------------------------------- */
"2401" = "AaBbCcDdEeFfGgHhIiJjKkLlMmNnOoPpQqRrSsTtUuVvWwXxYyZz__..";
"2402" = "MENU:";
"2403" = "SYSTEM";
"2404" = "SYSTEM - MAC";
"2405" = "SYSTEM - WIN";
"2406" = "Standard.xlib";
"2407" = "?";
"2408" = ",";
"2409" = "lingo.ini";
"2410" = "SYSTEM - WIN (DIR 4)";
"2601" = "Out of memory";
"2602" = "Name expected";
"2603" = "Symbol expected";
"2604" = "Handler definition expected";
"2605" = "Comma expected";
"2606" = "Variable already defined";
"2607" = "Command expected";
"2608" = "Right parenthesis expected";
"2609" = "Instance command not allow here";
"2610" = "Expected TO";
"2611" = "Expected WHILE or WITH";
"2612" = "Expected END REPEAT";
"2613" = "Expected =";
"2614" = "Expected TO";
"2615" = "Expected THEN";
"2616" = "Expected END IF";
"2617" = "Misplaced ELSE";
"2618" = "Expected OF";
"2619" = "Property name expected";
"2620" = "Cannot set this property";
"2621" = "Property modifier expected";
"2622" = "Factory name expected";
"2623" = "Misplaced END REPEAT";
"2624" = "Misplaced NEXT REPEAT";
"2625" = "Chunk expression expected";
"2626" = "Variable used before assigned a value";
"2627" = "Expected FIELD";
"2628" = "Expected WITHIN or INTERSECTS";
"2629" = "Number expected";
"2630" = "String does not end correctly";
"2631" = "Name already used";
"2632" = "Expected MOVIE";
"2633" = "Misspelled event";
"2634" = "Expected a variable";
"2635" = "Chunk specifier out of order";
"2636" = "Misplaced Operator";
"2637" = "Operator expected";
"2638" = "Operand expected";
"2639" = "Expected end of statement";
"2640" = "Unexpected end of statement";
"2641" = "Expected END TELL";
"2642" = "Misplaced EXIT TELL";
"2643" = "Property list did not start with property name";
"2644" = "End of property list expected";
"2645" = "Expected OF";
"2646" = "Expected END CASE";
"2647" = "Expected CASE clause";
"2648" = "Expected : ";
/* 15apr98 JT */
"2649" = "Expected Right Bracket ";
"2650" = "Index property reference expected ";
"2651" = "Comma expected. You may need to convert to member reference syntax: member(a,b) ";
"2652" = "Left parenthesis expected ";
/* --------------------------------------------------------------------------------------- */
"2201" = "<Null>";
"2202" = "<Void>";
"2203" = "<Object:%x>";
"2204" = "\n-- Global Variables --\n";
"2205" = "\n-- XObject Factories --\n";
"2206" = "\n-- Macro Factories --\n";
"2207" = "\n-- Local Variables --\n";
"2208" = "\n-- No Local Variables --\n";
"2209" = "\n-- Instance Variables --\n";
"2210" = "---- %d Entries\n";
"2211" = "-- Can not Describe, resource file is closed\n";
"2212" = "-- Factory: %p ID:%d\n";
"2213" = "-- Resource files: current=%d sound=%d app=%d\n";
"2214" = "---- doc=%d shared=%d\n";
"2215" = "-- Res: %16p Type: %4p Id:%5d Home: %d\n";
"2216" = "-- XLibraries:\n";
"2217" = "== Macro ^0";
"2218" = "== Method ^0 of Factory: ^1";
"2219" = "== MouseUp Script";
"2220" = "== MouseDown Script";
"2221" = "== Clickon Script for sprite: ";
"2222" = "== KeyDown Script";
"2223" = "on mouseUp me\n  \nend";
"2224" = "on mouseUp\n  \nend";
"2225" = "on exitFrame me\n  \nend";
"2226" = "on startMovie\n  \nend";
"2227" = "Loaded cast %12p";
"2228" = "Unable to load cast %12p";
"2229" = " frame=%4d movie=%12p seekOffset=%ld\n";
"2230" = "[";
"2231" = "]";
"2232" = ", ";
"2233" = "rect(";
"2234" = ")";
"2235" = "point(";
"2236" = "[:]";
"2237" = ": ";
"2238" = "(the stage)";
"2239" = "(window \"%p\")";
"2240" = "(member %d of castLib %d)";
"2241" = "(script \"%p\")";
"2242" = "<offspring \"%p\" %ld %lx>";
"2243" = "<actor %ld %lx>";
"2244" = "...";
"2245" = "<Xtra child \"%p\" %d %lx>";
"2246" = "<Xtra \"%p\" %d %lx>";
"2247" = "(castLib %d)";
"2248" = "(media %lx)";
"2249" = "(sprite %d)";
"2250" = "(sound %d)";
"2251" = "<Picture:%x>";
"2252" = "Macintosh,68k";
"2253" = "Macintosh,PowerPC";
"2254" = "Windows,16";
"2255" = "Windows,32";
"2256" = " net";
"2257" = "Prefs";
"2258" = "<Prop Ref %d %lx>";
"2259" = "date( %d, %d, %d )";
"2260" = "paletteIndex( %d )";
"2261" = "rgb( %d, %d, %d )";
"2262" = "(the globals)";
"2263" = "<Field Ref %d %lx>";
"2264" = "<mask:%x>";
"2265" = "<image:%x>";
"2266" = "timeOut(\"%p\")";
"2267" = "vector( ";
"2268" = "transform( ";
"2269" = "vertex( ";
"2270" = " )";
"2271" = "(channel %d)";
"2272" = "<Object %p %d %lx>";
"2273" = "color( %d )";
"2274" = "color( %d, %d, %d )";
"2275" = "function mouseUp(me) {\n  \n}";
"2276" = "function mouseUp() {\n  \n}";
"2277" = "function exitFrame(me) {\n  \n}";
"2278" = "function startMovie() {\n  \n}";
"2279" = "<filtertype:%s>";
/* --------------------------------------------------------------------------------------- */
"5001" = "A read error occurred on";
"5002" = "";
"5003" = "Unable to find the movie named ";
"5004" = "Unable to find the \"FileIO.dll\" x-object.  Check \"LINGO.INI\".";
"5005" = "Problem loading file ";
"5006" = "";
"5007" = "A script error occurred - error description too long!";
"1402" = "Director Player Error";
"5008" = "The Shockwave movie would like to store information on your hard disk. This information may be needed for the movie to operate correctly.";
"5009" = "Do you want to provide the contents of your clipboard to this movie?";
"5010" = "Security Alert";


// entries from iml/generic/filekey.en.str
// IDS_FILETYPE_LABEL + x
"9050" = "nullstring";											/* kFileType_None */
"9051" = "All Files";					/* kFileType_All */
"9052" = "Bitmap Image";				/* kFileType_Bitmap */
"9053" = "Palette";					/* kFileType_Palette */
"9054" = "Sound";						/* kFileType_Sound */
"9055" = "AVI";						/* kFileType_Video */
"9056" = "PICS";				/* kFileType_MultiImage */
"9057" = "Text";						/* kFileType_PlainText */
"9058" = "PICT";						/* kFileType_PICT */
"9059" = "Scrapbook";					/* kFileType_Scrapbook */
"9060" = "QuickTime";					/* kFileType_QuickTime */
"9061" = "AVI";						/* kFileType_AVI */
"9062" = "BMP";						/* kFileType_BMP */
"9063" = "GIF";						/* kFileType_GIF */
"9064" = "JPEG";						/* kFileType_JPEG */
"9065" = "Director Movie";				/* kFileType_PlayableMovie */
"9066" = "Director Cast";				/* kFileType_PlayableCast */
"9067" = "Director Movie or Cast";		/* kFileType_EditableMovieOrCast */
"9068" = "Director Movie";				/* kFileType_EditableMovie */
"9069" = "Director Cast";				/* kFileType_EditableCast */
"9070" = "Director Movie or Cast";		/* kFileType_AnyMovieOrCast */
"9071" = "Director Movie";				/* kFileType_AnyMovie */
"9072" = "Director Cast";				/* kFileType_AnyCast */
"9073" = "Director Movie";				/* kFileType_LatestEditableMovie */
"9074" = "Director Cast";				/* kFileType_LatestEditableCast */
"9075" = "Shockwave Movie";			/* kFileType_CompressedMovie */
"9076" = "Shockwave Cast";				/* kFileType_CompressedCast */
"9077" = "Movie Cast Xtra";			/* kFileType_ForProjector */
"9078" = "Xtra";						/* kFileType_MoaXtra */
"9079" = "Help";						/* kFileType_Help */
"9080" = "Application";				/* kFileType_Application */
"9081" = "Projector";					/* kFileType_Projector */
"9082" = "Resources";					/* kFileType_Resources */
"9083" = "Font Map";					/* kFileType_FontMap */
"9084" = "Script";						/* kFileType_Script */
"9085" = "SWA";						/* kFileType_SWA */
"9086" = "wav;mp4";												/* kFileType_AudioExport */

// entries from iml/mac/filekey.r
// IDS_FILETYPE_EXTS + x
"9100" = "nullstring";											/* kFileType_None */
"9101" = "*.*";													/* kFileType_All */
"9102" = "*.jpg;*.gif;*.bmp;*.dib;*.pic;*.pct;*.pict";			/* kFileType_Bitmap */
"9103" = "nullstring";											/* kFileType_Palette */
"9104" = "*.wav;*.aif;*.aiff;*.aifc;*.mp3;*.swa";				/* kFileType_Sound */
"9105" = "*.avi";												/* kFileType_Video */
"9106" = "nullstring";											/* kFileType_MultiImage */
"9107" = "*.txt";												/* kFileType_PlainText */
"9108" = "*.pic;*.pct;*.pict";									/* kFileType_PICT */
"9109" = "nullstring";											/* kFileType_Scrapbook */
"9110" = "*.mov;*.mpg;*.mpeg;*.mp4";								/* kFileType_QuickTime */
"9111" = "*.avi";												/* kFileType_AVI */
"9112" = "*.bmp;*.dib";											/* kFileType_BMP */
"9113" = "*.gif";												/* kFileType_GIF */
"9114" = "*.jpg;*.jpeg";											/* kFileType_JPEG */
"9115" = "*.dir;*.dcr;*.dxr";									/* kFileType_PlayableMovie */
"9116" = "*.cst;*.cct;*.cxt";									/* kFileType_PlayableCast */
"9117" = "*.dir;*.cst";											/* kFileType_EditableMovieOrCast */
"9118" = "*.dir";												/* kFileType_EditableMovie */
"9119" = "*.cst";												/* kFileType_EditableCast */
"9120" = "*.dir;*.dcr;*.dxr;*.cst;*.cct;*.cxt";					/* kFileType_AnyMovieOrCast */
"9121" = "*.dir;*.dcr;*.dxr";									/* kFileType_AnyMovie */
"9122" = "*.cst;*.cct;*.cxt";									/* kFileType_AnyCast */
"9123" = "*.dir";												/* kFileType_LatestEditableMovie */
"9124" = "*.cst";												/* kFileType_LatestEditableCast */
"9125" = "*.dcr";												/* kFileType_CompressedMovie */
"9126" = "*.cct";												/* kFileType_CompressedCast */
"9127" = "*.dir;*.cst";											/* kFileType_ForProjector */
"9128" = "nullstring";											/* kFileType_MoaXtra */
"9129" = "nullstring";											/* kFileType_Help */
"9130" = "*.app";												/* kFileType_Application */
"9131" = "nullstring";											/* kFileType_Projector */
"9132" = "nullstring";											/* kFileType_Resources */
"9133" = "*.txt";												/* kFileType_FontMap */
"9134" = "*.ls;*.js;*.txt";										/* kFileType_Script */
"9135" = "*.swa;*.mp3";											/* kFileType_SWA */
"9136" = "wav,mp4";												/* kFileType_AudioExport */

"9200" = "nullstring";											/* kFileType_None */
"9201" = "nullstring";											/* kFileType_All */
"9202" = "JPEGGIF BMP DIB PICT";									/* kFileType_Bitmap */
"9203" = "nullstring";											/* kFileType_Palette */
"9204" = "WAVEAIFFAIFCMPG3SwaT";									/* kFileType_Sound */
"9205" = "nullstring";											/* kFileType_Video */
"9206" = "PICS";													/* kFileType_MultiImage */
"9207" = "TEXT";													/* kFileType_PlainText */
"9208" = "PICT";													/* kFileType_PICT */
"9209" = "scbksbkt";												/* kFileType_Scrapbook */
"9210" = "MooV";													/* kFileType_QuickTime */
"9211" = "nullstring";											/* kFileType_AVI */
"9212" = "BMP ";													/* kFileType_BMP */
"9213" = "GIF ";													/* kFileType_GIF */
"9214" = "JPEG";													/* kFileType_JPEG */
"9215" = "nullstring";											/* kFileType_PlayableMovie */
"9216" = "nullstring";											/* kFileType_PlayableCast */
"9217" = "nullstring";											/* kFileType_EditableMovieOrCast */
"9218" = "nullstring";											/* kFileType_EditableMovie */
"9219" = "nullstring";											/* kFileType_EditableCast */
"9220" = "nullstring";											/* kFileType_AnyMovieOrCast */
"9221" = "nullstring";											/* kFileType_AnyMovie */
"9222" = "nullstring";											/* kFileType_AnyCast */
"9223" = "nullstring";											/* kFileType_LatestEditableMovie */
"9224" = "nullstring";											/* kFileType_LatestEditableCast */
"9225" = "nullstring";											/* kFileType_CompressedMovie */
"9226" = "nullstring";											/* kFileType_CompressedCast */
"9227" = "nullstring";											/* kFileType_ForProjector */
"9228" = "Xtra";													/* kFileType_MoaXtra */
"9229" = "APPL";													/* kFileType_Help */
"9230" = "APPL";													/* kFileType_Application */
"9231" = "PJ93";													/* kFileType_Projector */
"9232" = "DsJt";													/* kFileType_Resources */
"9233" = "TEXT";													/* kFileType_FontMap */
"9234" = "TEXT";													/* kFileType_Script */
"9235" = "SwaTMPG3Mp3 PLAY";										/* kFileType_SWA */
"9236" = "nullstring";											/* kFileType_AudioExport */

// entries from dp/mmp/mmp.r
// 
"Palu_41" = "0x00ff,0xffff, 0x05ff,0xff00, 0x06ff,0xccff, 0x0bff,0xcc00,0x0cff,0x99ff, 0x11ff,0x9900, 0x12ff,0x66ff, 0x17ff,0x6600,0x18ff,0x33ff, 0x1dff,0x3300, 0x1eff,0x00ff, 0x23ff,0x0000,0x24cc,0xffff, 0x29cc,0xff00, 0x2acc,0xccff, 0x2fcc,0xcc00,0x30cc,0x99ff, 0x35cc,0x9900, 0x36cc,0x66ff, 0x3bcc,0x6600,0x3ccc,0x33ff, 0x41cc,0x3300, 0x42cc,0x00ff, 0x47cc,0x0000,0x4899,0xffff, 0x4d99,0xff00, 0x4e99,0xccff, 0x5399,0xcc00,0x5499,0x99ff, 0x5999,0x9900, 0x5a99,0x66ff, 0x5f99,0x6600,0x6099,0x33ff, 0x6599,0x3300, 0x6699,0x00ff, 0x6b99,0x0000,0x6c66,0xffff, 0x7166,0xff00, 0x7266,0xccff, 0x7766,0xcc00,0x7866,0x99ff, 0x7d66,0x9900, 0x7e66,0x66ff, 0x8366,0x6600,0x8466,0x33ff, 0x8966,0x3300, 0x8a66,0x00ff, 0x8f66,0x0000,0x9033,0xffff, 0x9533,0xff00, 0x9633,0xccff, 0x9b33,0xcc00,0x9c33,0x99ff, 0xa133,0x9900, 0xa233,0x66ff, 0xa733,0x6600,0xa833,0x33ff, 0xad33,0x3300, 0xae33,0x00ff, 0xb333,0x0000,0xb400,0xffff, 0xb900,0xff00, 0xba00,0xccff, 0xbf00,0xcc00,0xc000,0x99ff, 0xc500,0x9900, 0xc600,0x66ff, 0xcb00,0x6600,0xcc00,0x33ff, 0xd100,0x3300, 0xd200,0x00ff, 0xd600,0x0033,0xd7ee,0x0000, 0xd8dd,0x0000, 0xd9bb,0x0000, 0xdaaa,0x0000,0xdb88,0x0000, 0xdc77,0x0000, 0xdd55,0x0000, 0xde44,0x0000,0xdf22,0x0000, 0xe011,0x0000, 0xe100,0xee00, 0xe200,0xdd00,0xe300,0xbb00, 0xe400,0xaa00, 0xe500,0x8800, 0xe600,0x7700,0xe700,0x5500, 0xe800,0x4400, 0xe900,0x2200, 0xea00,0x1100,0xeb00,0x00ee, 0xec00,0x00dd, 0xed00,0x00bb, 0xee00,0x00aa,0xef00,0x0088, 0xf000,0x0077, 0xf100,0x0055, 0xf200,0x0044,0xf300,0x0022, 0xf400,0x0011, 0xf5ee,0xeeee, 0xf6dd,0xdddd,0xf7bb,0xbbbb, 0xf8aa,0xaaaa, 0xf988,0x8888, 0xfa77,0x7777,0xfb55,0x5555, 0xfc44,0x4444, 0xfd22,0x2222, 0xff00,0x0000";
"Plau_42" = "0x00ff,0xffff, 0x0100,0x69ff, 0x0300,0x5dff, 0x0400,0x56ff, 0x0600,0x4aff, 0x0700,0x43ff, 0x0800,0x3dff, 0x0900,0x36ff, 0x0b00,0x2aff, 0x0c00,0x23ff, 0x0e00,0x17ff, 0x0f00,0x10ff, 0x1000,0x0aff, 0x1100,0x03ff, 0x1206,0x00ff, 0x130c,0x00ff, 0x1413,0x00ff, 0x161f,0x00ff, 0x1726,0x00ff, 0x182c,0x00ff, 0x1933,0x00ff, 0x1b3f,0x00ff, 0x1c46,0x00ff, 0x1e52,0x00ff, 0x1f59,0x00ff, 0x205f,0x00ff, 0x2166,0x00ff, 0x2372,0x00ff, 0x2479,0x00ff, 0x2685,0x00ff, 0x278c,0x00ff, 0x2892,0x00ff, 0x2999,0x00ff, 0x2ba5,0x00ff, 0x2cac,0x00ff, 0x2eb8,0x00ff, 0x2fbf,0x00ff, 0x30c5,0x00ff, 0x31cc,0x00ff, 0x33d8,0x00ff, 0x34df,0x00ff, 0x36eb,0x00ff, 0x37f2,0x00ff, 0x38f8,0x00ff, 0x39ff,0x00ff, 0x3aff,0x00f8, 0x3bff,0x00f2, 0x3cff,0x00eb, 0x3eff,0x00df, 0x3fff,0x00d8, 0x41ff,0x00cc, 0x42ff,0x00c5, 0x43ff,0x00bf, 0x44ff,0x00b8, 0x46ff,0x00ac, 0x47ff,0x00a5, 0x49ff,0x0099, 0x4aff,0x0092, 0x4bff,0x008c, 0x4cff,0x0085, 0x4eff,0x0079, 0x4fff,0x0072, 0x51ff,0x0066, 0x52ff,0x005f, 0x53ff,0x0059, 0x54ff,0x0052, 0x56ff,0x0046, 0x57ff,0x003f, 0x59ff,0x0033, 0x5aff,0x002c, 0x5bff,0x0026, 0x5cff,0x001f, 0x5eff,0x0013, 0x5fff,0x000c, 0x61ff,0x0000, 0x63ff,0x0c00, 0x64ff,0x1300, 0x66ff,0x1f00, 0x67ff,0x2600, 0x68ff,0x2c00, 0x69ff,0x3300, 0x6bff,0x3f00, 0x6cff,0x4600, 0x6eff,0x5200, 0x6fff,0x5900, 0x70ff,0x5f00, 0x71ff,0x6600, 0x73ff,0x7200, 0x74ff,0x7900, 0x76ff,0x8500, 0x77ff,0x8c00, 0x78ff,0x9200, 0x79ff,0x9900, 0x7bff,0xa500, 0x7cff,0xac00, 0x7eff,0xb800, 0x7fff,0xbf00, 0x80ff,0xc500, 0x81ff,0xcc00, 0x83ff,0xd800, 0x84ff,0xdf00, 0x86ff,0xeb00, 0x87ff,0xf200, 0x88ff,0xf800, 0x89ff,0xff00, 0x8af8,0xff00, 0x8bf2,0xff00, 0x8ceb,0xff00, 0x8edf,0xff00, 0x8fd8,0xff00, 0x91cc,0xff00, 0x92c5,0xff00, 0x93bf,0xff00, 0x94b8,0xff00, 0x96ac,0xff00, 0x97a5,0xff00, 0x9999,0xff00, 0x9a92,0xff00, 0x9b8c,0xff00, 0x9c85,0xff00, 0x9e79,0xff00, 0x9f72,0xff00, 0xa166,0xff00, 0xa25f,0xff00, 0xa359,0xff00, 0xa452,0xff00, 0xa646,0xff00, 0xa73f,0xff00, 0xa933,0xff00, 0xaa2c,0xff00, 0xab26,0xff00, 0xac1f,0xff00, 0xae13,0xff00, 0xaf0c,0xff00, 0xb100,0xff00, 0xb300,0xff0c, 0xb400,0xff13, 0xb600,0xff1f, 0xb700,0xff26, 0xb800,0xff2c, 0xb900,0xff33, 0xbb00,0xff3f, 0xbc00,0xff46, 0xbe00,0xff52, 0xbf00,0xff59, 0xc000,0xff5f, 0xc100,0xff66, 0xc300,0xff72, 0xc400,0xff79, 0xc600,0xff85, 0xc700,0xff8c, 0xc800,0xff92, 0xc900,0xff99, 0xcb00,0xffa5, 0xcc00,0xffac, 0xce00,0xffb8, 0xcf00,0xffbf, 0xd000,0xffc5, 0xd100,0xffcc, 0xd300,0xffd8, 0xd400,0xffdf, 0xd600,0xffeb, 0xd700,0xfff2, 0xd800,0xfff8, 0xd900,0xffff, 0xda00,0xf8ff,0xdb00,0xf2ff, 0xdc00,0xebff, 0xde00,0xdfff, 0xdf00,0xd8ff, 0xe100,0xccff, 0xe200,0xc5ff, 0xe300,0xbfff, 0xe400,0xb8ff, 0xe600,0xacff, 0xe700,0xa5ff, 0xe900,0x99ff, 0xea00,0x92ff, 0xeb00,0x8cff, 0xec00,0x85ff, 0xee00,0x79ff, 0xef00,0x72ff, 0xf0f0,0xf0f0, 0xff00,0x0000";
"Palu_43" = "0x00ff,0xffff, 0xff00,0x0000";
"Palu_44" = "0x00ff,0xffff, 0x01fe,0xfef2, 0x02fe,0xfde6, 0x03fe,0xfdda, 0x05fe,0xfbc2, 0x06fe,0xfbb6, 0x07fe,0xfaaa, 0x08fd,0xfa9d, 0x0afd,0xf885, 0x0bfd,0xf879, 0x0cfd,0xf76d, 0x0dfd,0xf761, 0x0efd,0xf655, 0x0ffc,0xf548, 0x10fc,0xee47, 0x13fc,0xd947, 0x14fd,0xd247, 0x16fd,0xc447, 0x17fd,0xbe47, 0x18fd,0xb747, 0x19fe,0xb047, 0x1dfe,0x9447, 0x1eff,0x8d46, 0x1ffd,0x8846, 0x20fb,0x8446, 0x21f9,0x7f46, 0x22f8,0x7b47, 0x23f6,0x7747, 0x24f4,0x7247, 0x25f3,0x6e47, 0x26f1,0x6a48, 0x27ef,0x6548, 0x28ee,0x6148, 0x29ec,0x5d48, 0x2aea,0x5849, 0x2be9,0x5449, 0x2ce7,0x5049, 0x2de5,0x4b4a, 0x2fdf,0x4748, 0x30dc,0x4548, 0x31d9,0x4347, 0x32d6,0x4147, 0x33d4,0x3f46, 0x34d1,0x3d46, 0x35ce,0x3b45, 0x36cb,0x3945, 0x37c8,0x3744, 0x38c6,0x3544, 0x39c3,0x3343, 0x3ac0,0x3143, 0x3cba,0x2d41, 0x3dbe,0x2f47, 0x3fc6,0x3355, 0x40ca,0x355b, 0x43d6,0x3b70, 0x44da,0x3d76, 0x47e6,0x438b, 0x48ea,0x4591, 0x4bf6,0x4ba6, 0x4ced,0x4aa7, 0x4de5,0x4aa9, 0x4edc,0x49aa, 0x4fd4,0x49ac, 0x50cc,0x48ad, 0x51c3,0x48af, 0x52bb,0x48b0, 0x53b3,0x47b2, 0x54aa,0x47b3, 0x55a2,0x46b5, 0x569a,0x46b6, 0x5791,0x46b8, 0x5889,0x45b9, 0x5981,0x45bb, 0x5a78,0x44bd, 0x5b74,0x44bf, 0x5c71,0x44c1, 0x5d6d,0x44c4, 0x5e6a,0x44c6, 0x5f66,0x44c8, 0x6063,0x44cb, 0x6160,0x44cd, 0x625c,0x44cf, 0x6359,0x44d2, 0x6455,0x44d4, 0x6552,0x44d6, 0x664f,0x44d9, 0x674b,0x44db, 0x6848,0x44dd, 0x6944,0x45e0, 0x6b44,0x55e2, 0x6c44,0x5ee3, 0x6d44,0x66e4, 0x6e45,0x6ee5, 0x6f45,0x77e6, 0x7145,0x87e8, 0x7245,0x90e9, 0x7346,0x98ea, 0x7446,0xa0eb, 0x7546,0xa9ec, 0x7746,0xb9ee, 0x7847,0xc2f0, 0x7948,0xc2e5, 0x7a49,0xc3db, 0x7b4b,0xc3d0, 0x7c4c,0xc4c6, 0x7d4e,0xc5bb, 0x7e4f,0xc5b1, 0x7f50,0xc6a7, 0x8052,0xc69c, 0x8153,0xc792, 0x8255,0xc887, 0x8356,0xc87d, 0x8457,0xc973, 0x8559,0xc968, 0x865a,0xca5e, 0x875c,0xcb53, 0x885a,0xc752, 0x8958,0xc352, 0x8a57,0xbf52, 0x8b55,0xbb52, 0x8c54,0xb752, 0x8d52,0xb352, 0x8e51,0xaf52, 0x8f4f,0xab52, 0x904e,0xa752, 0x914c,0xa352, 0x924b,0x9f52, 0x9349,0x9b52, 0x9448,0x9752, 0x9546,0x9352, 0x9644,0x8f51, 0x984c,0x894f, 0x9950,0x864f, 0x9a55,0x844e, 0x9b59,0x814e, 0x9c5d,0x7e4d, 0x9d61,0x7b4d, 0x9e66,0x794c, 0x9f6a,0x764c, 0xa06e,0x734b, 0xa172,0x704b, 0xa277,0x6e4a, 0xa37b,0x6b4a, 0xa47f,0x6849, 0xa584,0x6548, 0xa68c,0x6e48, 0xa89c,0x8248, 0xa9a4,0x8b48, 0xabb4,0x9f48, 0xacbc,0xa848, 0xaecc,0xbc48, 0xafd4,0xc548, 0xb1e4,0xd948, 0xb2ec,0xe248, 0xb3f4,0xec48, 0xb4fd,0xf649, 0xb5fb,0xea49, 0xb6f9,0xdf49, 0xb7f8,0xd349, 0xb8f6,0xc849, 0xb9f5,0xbd49, 0xbaf3,0xb149, 0xbbf2,0xa649, 0xbcf0,0x9b49, 0xbdef,0x8f49, 0xbeed,0x8449, 0xbfec,0x7949, 0xc0ea,0x6d49, 0xc1e9,0x6249, 0xc2e7,0x5749, 0xc3e5,0x4b4a, 0xcaec,0x4b74, 0xcbee,0x4b7b, 0xd1f4,0x4b9f, 0xd2f6,0x4ba6, 0xd3ea,0x4aa9, 0xd4de,0x4aad, 0xd5d2,0x49b1, 0xd6c6,0x49b5, 0xd7ba,0x48b9, 0xd8af,0x48bd, 0xd9a3,0x48c1, 0xda97,0x47c4, 0xdb8b,0x47c8, 0xdc7f,0x46cc, 0xdd74,0x46d0, 0xde68,0x46d4, 0xdf5c,0x45d8, 0xe050,0x45dc, 0xe144,0x44e0, 0xe35a,0x5ae2, 0xe466,0x66e3, 0xe571,0x71e4, 0xe67d,0x7de5, 0xe788,0x88e6, 0xe894,0x94e7, 0xe99f,0x9fe8, 0xeaab,0xabe9, 0xebb6,0xb6ea, 0xecc2,0xc2eb, 0xedcd,0xcdec, 0xeed9,0xd9ed, 0xefe4,0xe4ee, 0xf0f0,0xf0f0, 0xff00,0x0000";
"Palu_45" = "0x00ff,0xffff, 0x01fe,0xfeee, 0x03fe,0xfccc, 0x04fe,0xfbbc, 0x05fd,0xfaab, 0x06fd,0xfa9a, 0x07fd,0xf98a, 0x09fd,0xf768, 0x0afc,0xf658, 0x0bfc,0xf647, 0x0cfc,0xf536, 0x0dfc,0xf426, 0x0efc,0xf315, 0x0ffb,0xf204, 0x10fb,0xe803, 0x11fb,0xdf03, 0x12fb,0xd503, 0x13fc,0xcc03, 0x14fc,0xc203, 0x15fc,0xb903, 0x16fc,0xaf03, 0x17fd,0xa602, 0x18fd,0x9c02, 0x19fd,0x9302, 0x1afd,0x8902, 0x1bfe,0x8002, 0x1cfe,0x7602, 0x1dfe,0x6d02, 0x1eff,0x6301, 0x1ffc,0x5c01, 0x20fa,0x5601, 0x21f8,0x5002, 0x22f5,0x4a02, 0x23f3,0x4402, 0x24f1,0x3e03, 0x25ef,0x3803, 0x26ec,0x3203, 0x27ea,0x2c04, 0x29e6,0x2004, 0x2ae3,0x1a05, 0x2cdf,0x0e05, 0x2ddc,0x0706, 0x2ed8,0x0607, 0x2fd5,0x0608, 0x30d2,0x0509, 0x31ce,0x050a, 0x32cb,0x040c, 0x33c8,0x040d, 0x34c5,0x030e, 0x35c1,0x030f, 0x36be,0x0210, 0x37bb,0x0212, 0x38b8,0x0113, 0x39b4,0x0114, 0x3ab1,0x0015, 0x3bae,0x0016, 0x3caa,0x0018, 0x3dae,0x001f, 0x3eb3,0x0126, 0x3fb8,0x012d, 0x40bd,0x0234, 0x41c2,0x023c, 0x42c6,0x0343, 0x43cb,0x034a, 0x44d0,0x0451, 0x45d5,0x0458, 0x46da,0x0560, 0x47de,0x0567, 0x48e3,0x066e, 0x49e8,0x0675, 0x4aed,0x077c, 0x4bf2,0x0884, 0x4ce6,0x0786, 0x4ddb,0x0688, 0x4ecf,0x068a, 0x4fc4,0x058c, 0x50b8,0x058f, 0x51ad,0x0491, 0x52a1,0x0493, 0x5396,0x0395, 0x548a,0x0397, 0x557f,0x029a, 0x5673,0x029c, 0x5768,0x019e, 0x585c,0x01a0, 0x5951,0x00a2, 0x5a45,0x00a5, 0x5c3b,0x00ab, 0x5d37,0x00ae, 0x5f2d,0x00b4, 0x6029,0x00b7, 0x6124,0x00ba, 0x6220,0x00be, 0x6416,0x00c4, 0x6512,0x00c7, 0x660d,0x00ca, 0x6709,0x00cd, 0x6804,0x00d0, 0x6900,0x00d4, 0x6b00,0x16d6, 0x6c00,0x22d8, 0x6d00,0x2dd9, 0x6e00,0x39db, 0x6f00,0x44dc, 0x7000,0x4fde, 0x7101,0x5bdf, 0x7201,0x66e1, 0x7301,0x72e2, 0x7401,0x7de4, 0x7501,0x88e5, 0x7601,0x94e7, 0x7701,0x9fe8, 0x7802,0xabea, 0x7903,0xabdb, 0x7b07,0xadbf, 0x7c09,0xaeb0, 0x7d0b,0xafa2, 0x7e0d,0xaf94, 0x7f0f,0xb086, 0x8011,0xb177, 0x8215,0xb35b, 0x8317,0xb34d, 0x8419,0xb43e, 0x861d,0xb622, 0x871f,0xb713, 0x881c,0xb112, 0x891a,0xab12, 0x8a18,0xa612, 0x8b16,0xa012, 0x8c14,0x9b12, 0x8d12,0x9512, 0x8e10,0x9012, 0x8f0e,0x8a11, 0x900c,0x8511, 0x910a,0x7f11, 0x9208,0x7a11, 0x9306,0x7411, 0x9404,0x6f11, 0x9502,0x6911, 0x9600,0x6310, 0x9705,0x5f0f, 0x9911,0x570d, 0x9a16,0x540d, 0x9c22,0x4c0b, 0x9d28,0x490a, 0x9e2d,0x450a, 0x9f33,0x4109, 0xa039,0x3e08, 0xa13f,0x3a07, 0xa244,0x3607, 0xa34a,0x3306, 0xa556,0x2b04, 0xa76c,0x4504, 0xa877,0x5304, 0xaa8d,0x6d04, 0xab98,0x7b04, 0xadae,0x9504, 0xaeb9,0xa304, 0xb0cf,0xbd04, 0xb1da,0xcb04, 0xb3f0,0xe504, 0xb4fc,0xf305, 0xb5f9,0xe305, 0xb7f5,0xc305, 0xb8f3,0xb405, 0xbaef,0x9405, 0xbbed,0x8505, 0xbde9,0x6505, 0xbee7,0x5605, 0xc0e3,0x3605, 0xc1e1,0x2705, 0xc2df,0x1705, 0xc3dc,0x0706, 0xc5de,0x0716, 0xc6e0,0x071f, 0xc7e1,0x0727, 0xc8e3,0x0730, 0xc9e4,0x0738, 0xcae6,0x0740, 0xcbe7,0x0749, 0xcce9,0x0751, 0xcdea,0x075a, 0xceec,0x0762, 0xcfed,0x076a, 0xd0ef,0x0773, 0xd1f0,0x077b, 0xd2f2,0x0884, 0xd3e1,0x0789, 0xd4d1,0x068e, 0xd5c1,0x0694, 0xd6b1,0x0599, 0xd7a1,0x059e, 0xd891,0x04a4, 0xd981,0x04a9, 0xda70,0x03ae, 0xdb60,0x03b4, 0xdc50,0x02b9, 0xdd40,0x02be, 0xde30,0x01c4, 0xdf20,0x01c9, 0xe010,0x00ce, 0xe100,0x00d4, 0xe210,0x10d5, 0xe870,0x70e1, 0xe980,0x80e2, 0xf0f0,0xf0f0, 0xff00,0x0000";
"Palu_46" = "0x00ff,0xffff, 0x0159,0x2b85, 0x025d,0x215f, 0x037b,0x2852, 0x049a,0x3044, 0x05a1,0x3d42, 0x06a5,0x4341, 0x07a9,0x473e, 0x08ac,0x4b3a, 0x09b0,0x4f37, 0x0ab4,0x5333, 0x0bba,0x6635, 0x0cc1,0x7a36, 0x0dc8,0x8d37, 0x0ecf,0xa139, 0x0fd5,0xb53a, 0x11e3,0xdd3c, 0x12c6,0xd438, 0x13ac,0xce37, 0x1493,0xc835, 0x1579,0xc333, 0x1660,0xbd31, 0x1746,0xb72f, 0x182d,0xb12d, 0x1927,0x9a3c, 0x1a21,0x8349, 0x1b1b,0x6c55, 0x1c19,0x5b65, 0x1d21,0x5884, 0x1e29,0x52a3, 0x1f30,0x4bc2, 0x201c,0xc2d5, 0x2230,0xc4d5, 0x233b,0xc5d5, 0x2fb3,0xd1d5, 0x30b1,0xf2b9, 0x31a5,0xf0ad, 0x329a,0xefa1, 0x338e,0xed94, 0x3482,0xec88, 0x3576,0xea7c, 0x366b,0xe870, 0x375f,0xe763, 0x3853,0xe557, 0x3947,0xe44b, 0x3a3b,0xe23f, 0x3b30,0xe032, 0x3c24,0xdf26, 0x3d18,0xdd1a, 0x3e0c,0xdc0e, 0x3f01,0xda01, 0x4001,0xc801, 0x4100,0xbb01, 0x4200,0xae01, 0x4300,0xa001, 0x4400,0x9301, 0x4500,0x8501, 0x4600,0x7800, 0x4700,0x6b00, 0x4800,0x5d00, 0x4900,0x5000, 0x4a00,0x4200, 0x4c00,0x2800, 0x4d00,0x1a00, 0x4f00,0x0000, 0x500a,0x0900, 0x5222,0x2102, 0x532e,0x2d02, 0x543a,0x3903, 0x5546,0x4404, 0x5652,0x5005, 0x575e,0x5c05, 0x586a,0x6806, 0x5977,0x7407, 0x5a83,0x8008, 0x5b8f,0x8b08, 0x5eb3,0xaf0b, 0x5fbf,0xbb0b, 0x60c5,0xc00c, 0x61c8,0xc415, 0x62cb,0xc71d, 0x63cf,0xca26, 0x67db,0xd64a, 0x68df,0xd952, 0x6ceb,0xe576, 0x6def,0xe87f, 0x6ef2,0xeb87, 0x6ff5,0xee90, 0x70d9,0xafa1, 0x71d9,0xa998, 0x72d9,0xa28f, 0x73d9,0x9c87, 0x74d9,0x957e, 0x75d9,0x8f76, 0x76d9,0x886d, 0x77d9,0x8265, 0x78d9,0x7b5c, 0x79d9,0x7553, 0x7ad9,0x6e4b, 0x7bd9,0x6842, 0x7cd9,0x613a, 0x7dd9,0x5b31, 0x7ed9,0x5429, 0x7fd9,0x4e20, 0x80d9,0x4a1b, 0x81cb,0x4519, 0x82bc,0x4017, 0x83ae,0x3b16, 0x849f,0x3614, 0x8591,0x3112, 0x8682,0x2c10, 0x8774,0x270e, 0x8865,0x220c, 0x8957,0x1d0b, 0x8a48,0x1809, 0x8b3a,0x1307, 0x8c2b,0x0e05, 0x8d1d,0x0903, 0x8e0e,0x0501, 0x8f00,0x0000, 0x9000,0x0000, 0x910b,0x0002, 0x9217,0x0004, 0x9317,0x0306, 0x9422,0x040a, 0x952e,0x060d, 0x9639,0x0710, 0x9745,0x0914, 0x9851,0x0b17, 0x995c,0x0c1a, 0x9a68,0x0e1e, 0x9b73,0x0f21, 0x9c7f,0x1125, 0x9d8b,0x1328, 0x9e96,0x142b, 0x9fa2,0x162f, 0xa0a2,0x162f, 0xa1b1,0x0b2a, 0xa2b5,0x1735, 0xa3b9,0x223f, 0xa4bd,0x2e4a, 0xa5c1,0x3955, 0xa6c4,0x4560, 0xa7c8,0x506b, 0xa8cc,0x5c76, 0xa9d0,0x6781, 0xaad4,0x738c, 0xabd7,0x7e97, 0xacdb,0x8aa2, 0xaddf,0x95ad, 0xafe7,0xadc3, 0xb0c9,0xaaf0, 0xb1c3,0xa1ef, 0xb3b9,0x8deb, 0xb4b3,0x84e9, 0xb5ae,0x7ae8, 0xb6a8,0x70e6, 0xb7a3,0x67e4, 0xb89e,0x5de3, 0xb998,0x53e1, 0xba93,0x4adf, 0xbb8d,0x40dd, 0xbc88,0x36dc, 0xbd83,0x2dda, 0xbe7d,0x23d8, 0xbf78,0x19d7, 0xc075,0x0fd7, 0xc16d,0x0ec9, 0xc266,0x0dbc, 0xc35f,0x0cae, 0xc457,0x0ba1, 0xc550,0x0a93, 0xc649,0x0986, 0xc741,0x0878, 0xc83a,0x076b, 0xc932,0x065d, 0xca2b,0x0550, 0xcb24,0x0442, 0xcc1c,0x0335, 0xcd15,0x0227, 0xce0e,0x011a, 0xcf06,0x000c, 0xd000,0x0416, 0xd200,0x0830, 0xd300,0x0b3d, 0xd400,0x0d4a, 0xd500,0x1057, 0xd700,0x1471, 0xd800,0x177e, 0xd900,0x198b, 0xda00,0x1c98, 0xdc00,0x20b2, 0xdd00,0x23bf, 0xdf00,0x27d9, 0xe000,0x29e3, 0xe10f,0x36e4, 0xe21d,0x42e5, 0xe32c,0x4fe6, 0xe43b,0x5be6, 0xe54a,0x67e7, 0xe659,0x74e8, 0xe768,0x80e9, 0xe877,0x8ce9, 0xe986,0x99ea, 0xea95,0xa5eb, 0xeba4,0xb2ec, 0xecb3,0xbeec, 0xedc2,0xcaed, 0xeed1,0xd7ee, 0xefe0,0xe3ef, 0xf0f0,0xf0f0, 0xff00,0x0000";
"Palu_47" = "0x00ff,0xffff, 0x0166,0x4c80, 0x025f,0x426c, 0x0358,0x3759, 0x0475,0x475e, 0x0594,0x5863, 0x069b,0x6669, 0x079f,0x6c6a, 0x08a3,0x6d68, 0x09a6,0x6f66, 0x0aaa,0x7365, 0x0bae,0x7967, 0x0cb4,0x866b, 0x10d0,0xbe7b, 0x11dd,0xda83,0x12c7,0xce7b, 0x13b6,0xc877, 0x14a6,0xc374, 0x1596,0xbd70, 0x1685,0xb76d, 0x1776,0xb169, 0x1866,0xab66, 0x1958,0x9463, 0x1a4a,0x7d5f, 0x1b38,0x5a5f, 0x1c43,0x6176, 0x1d4e,0x678e, 0x1e58,0x6da5, 0x1f63,0x73bc, 0x2044,0x2a5c, 0x214e,0x3566, 0x2258,0x3f6f, 0x2362,0x4a79, 0x246c,0x5582, 0x2576,0x5f8c, 0x2680,0x6a95, 0x278a,0x759f, 0x2894,0x7fa8, 0x299e,0x8ab2, 0x2aa8,0x94bb, 0x2bb2,0x9fc4, 0x2cbc,0xaace, 0x2dc6,0xb4d7, 0x2ed0,0xbfe1, 0x2fda,0xcaea, 0x30e4,0xd4f4, 0x31da,0xc9ea, 0x32cf,0xbee0, 0x33c4,0xb2d6, 0x34b9,0xa7cb, 0x35af,0x9cc1, 0x36a4,0x90b7, 0x3799,0x85ad, 0x388f,0x7aa3, 0x3984,0x6e99, 0x3a79,0x638f, 0x3b6f,0x5885, 0x3c64,0x4c7b, 0x3e4e,0x3667, 0x3f44,0x2a5c, 0x4051,0x201f, 0x415c,0x2b2b, 0x4267,0x3737, 0x4372,0x4242, 0x447d,0x4d4e, 0x4587,0x5859, 0x479d,0x6e71, 0x48a8,0x797c, 0x49b3,0x8488, 0x4abe,0x9094, 0x4bc9,0x9b9f, 0x4ddf,0xb1b7, 0x4eea,0xbcc2, 0x4ff5,0xc7ce, 0x50ff,0xd2da, 0x51f4,0xc6cd, 0x52e8,0xbbc1, 0x53dd,0xafb4, 0x54d1,0xa3a8, 0x55c5,0x979b, 0x56ba,0x8b8f, 0x57ae,0x7f83, 0x58a2,0x7376, 0x5997,0x676a, 0x5a8b,0x5c5d, 0x5b7f,0x5051, 0x5c74,0x4445, 0x5d68,0x3838, 0x5e5d,0x2c2c, 0x5f51,0x201f, 0x6044,0x2619, 0x614f,0x3122, 0x6259,0x3b2c, 0x646f,0x5140, 0x6579,0x5b49, 0x6684,0x6653, 0x678e,0x715d, 0x6899,0x7b66, 0x69a4,0x8670, 0x6aae,0x917a, 0x6bb9,0x9b83, 0x6cc3,0xa68d, 0x6dce,0xb197, 0x6ed9,0xbba1, 0x6fe3,0xc6aa, 0x70ee,0xd1b4, 0x71e3,0xc3a5, 0x72d7,0xb89b, 0x73cc,0xac91, 0x74c1,0xa187, 0x75b5,0x967d, 0x779f,0x8069, 0x7893,0x745f, 0x7a7d,0x5e4b, 0x7b71,0x5341, 0x7c66,0x4837, 0x7d5b,0x3c2d, 0x7e4f,0x3123, 0x7f44,0x2619, 0x8076,0x5512, 0x8180,0x5d1c, 0x828a,0x6626, 0x8393,0x6e2f, 0x849d,0x7739, 0x85a7,0x7f43, 0x86b1,0x884c, 0x87bb,0x9156, 0x88c5,0x995f, 0x89ce,0xa269, 0x8ad8,0xaa73, 0x8be2,0xb37c, 0x8cec,0xbb86, 0x8df6,0xc48f, 0x8eff,0xcc99, 0x8fff,0xd5ab, 0x90ff,0xe1c2, 0x91ff,0xd8b1, 0x92f6,0xc48f, 0x93ec,0xbb86, 0x94e2,0xb37c, 0x95d8,0xaa73, 0x96ce,0xa269, 0x97c5,0x995f, 0x98bb,0x9156, 0x99b1,0x884c, 0x9aa7,0x7f43, 0x9b9d,0x7739, 0x9c93,0x6e2f, 0x9d8a,0x6626, 0x9e80,0x5d1c, 0x9f76,0x5512, 0xa003,0x3003, 0xa10f,0x3d0f, 0xa21a,0x4a1a, 0xa326,0x5726, 0xa431,0x6431, 0xa649,0x7e49, 0xa754,0x8b54, 0xa860,0x9860, 0xa96b,0xa56b, 0xaa77,0xb277, 0xab82,0xbf83, 0xac8e,0xcc8e, 0xad9a,0xd99a, 0xaea5,0xe6a5, 0xafb1,0xf2b1, 0xb0bc,0xffbc, 0xb1b0,0xf2b0, 0xb2a4,0xe4a4, 0xb397,0xd697, 0xb57f,0xba7f, 0xb672,0xad72, 0xb85a,0x915a, 0xb94d,0x834d, 0xba41,0x7541, 0xbb34,0x6735, 0xbc28,0x5a28, 0xbd1c,0x4c1c, 0xbe0f,0x3e10, 0xbf03,0x3003, 0xc000,0x0f55, 0xc10d,0x1d60, 0xc21b,0x2a6a, 0xc329,0x3775, 0xc437,0x4580, 0xc545,0x528a, 0xc653,0x5f95, 0xc761,0x6da0, 0xc86f,0x7aaa, 0xc97d,0x87b5, 0xca8a,0x95c0, 0xcb98,0xa2ca, 0xcca6,0xafd5, 0xcdb4,0xbde0, 0xcec2,0xcaea, 0xcfd0,0xd7f5, 0xd0de,0xe5ff, 0xd1cf,0xd6f4, 0xd2c0,0xc8e9, 0xd3b1,0xbadd, 0xd4a3,0xacd2, 0xd594,0x9dc7, 0xd685,0x8fbb, 0xd867,0x73a5, 0xd958,0x6599, 0xda4a,0x568e, 0xdb3b,0x4883, 0xdc2c,0x3a77, 0xde0e,0x1e61, 0xdf00,0x0f55, 0xe011,0x1111, 0xe55c,0x5c5c, 0xe66a,0x6a6a, 0xeff1,0xf1f1, 0xf0fe,0xffff, 0xf1ee,0xeeee, 0xff00,0x0000";
"Palu_48" = "/* first 10 are windows UI colors*/0x00ff,0xffff, 0x0100,0xffff, 0x02ff,0x00ff, 0x0300,0x00ff, 0x04ff,0xff00, 0x0500,0xff00, 0x06ff,0x0000, 0x0780,0x8080, 0x08a0,0xa0a4, 0x09ff,0xfbf0, /* 216 web colors--first one can&apos;t be white because we can&apos;t duplicate white*/0x0aff,0xfffe, 0x0bff,0xffcc, 0x0fff,0xff00, 0x10ff,0xccff, 0x15ff,0xcc00, 0x16ff,0x99ff, 0x1bff,0x9900, 	0x1cff,0x66ff, 0x21ff,0x6600,0x22ff,0x33ff, 0x27ff,0x3300, 0x28ff,0x00ff, 0x2dff,0x0000, 0x2ecc,0xffff, 0x33cc,0xff00, 0x34cc,0xccff, 0x39cc,0xcc00, 0x3acc,0x99ff, 0x3fcc,0x9900, 0x40cc,0x66ff, 0x45cc,0x6600,0x46cc,0x33ff, 0x4bcc,0x3300, 0x4ccc,0x00ff, 0x51cc,0x0000, 0x5299,0xffff, 0x5799,0xff00, 	0x5899,0xccff, 0x5d99,0xcc00, 0x5e99,0x99ff, 0x6399,0x9900, 0x6499,0x66ff, 0x6999,0x6600,0x6a99,0x33ff, 0x6f99,0x3300, 0x7099,0x00ff, 0x7599,0x0000, 	0x7666,0xffff, 0x7b66,0xff00, 0x7c66,0xccff, 0x8166,0xcc00, 0x8266,0x99ff, 0x8766,0x9900, 0x8866,0x66ff, 0x8d66,0x6600,0x8e66,0x33ff, 0x9366,0x3300, 	0x9466,0x00ff, 0x9966,0x0000, 0x9a33,0xffff, 0x9f33,0xff00, 0xa033,0xccff, 0xa533,0xcc00, 0xa633,0x99ff, 0xab33,0x9900, 0xac33,0x66ff, 0xb133,0x6600, 0xb233,0x33ff, 0xb733,0x3300, 0xb833,0x00ff, 0xbd33,0x0000, 0xbe00,0xffff, 0xc300,0xff00, 0xc400,0xccff, 0xc900,0xcc00, 0xca00,0x99ff, 0xcf00,0x9900,0xd000,0x66ff, 0xd500,0x6600,   0xd600,0x33ff, 0xdb00,0x3300, /* only interpolate 3 values here since we can&apos;t have a black palette value in a non-final slot, so I make it 000001. */0xdc00,0x00ff, 0xe000,0x0033, 0xe100,0x0001,/* the unused sad ones at 000001*/0xe200,0x0001, 0xf400,0x0001, /* this is a gray used by the mac ui */0xf5dd, 0xdddd,/* last 10 are windows UI colors*/0xf6a6,0xcaf0, 0xf7c0,0xdcc0, 0xf8c0,0xc0c0, 0xf900,0x8080,0xfa80,0x0080, 0xfb00,0x0080, 0xfc80,0x8000, 0xfd00,0x8000, 0xfe80,0x0000, 0xff00,0x0000";
"Palu_141" = "0x00FF,0xFFFF, 0x0100,0xFFFF, 0x02FF,0x00FF, 0x0300,0x00FF,0x04FF,0xFF00, 0x0500,0xFF00, 0x06FF,0x0000, 0x0780,0x8080,0x08A0,0xA0A4, 0x09FF,0xFBF0, 0x0a33,0x3333, 0x0b99,0x6600,0x0c33,0x6633, 0x0d00,0x3399, 0x0eCC,0x00FF, 0x0f88,0x0000,0x10FF,0xCC66, 0x11FF,0x99CC, 0x12DD,0xDDDD, 0x13FF,0x9900,0x14FF,0x66FF, 0x19FF,0x6600, 0x1aFF,0x33FF, 0x1fFF,0x3300,0x20FF,0x00CC, 0x23FF,0x0033, 0x24CC,0xFFFF, 0x29CC,0xFF00,0x2aCC,0xCCFF, 0x2fCC,0xCC00, 0x30CC,0x99FF, 0x35CC,0x9900,0x36CC,0x66FF, 0x3bCC,0x6600, 0x3cCC,0x33FF, 0x41CC,0x3300,0x42D4,0x08FF, 0x43CC,0x00CC, 0x47CC,0x0000, 0x4899,0xFFFF,0x4d99,0xFF00, 0x4e99,0xCCFF, 0x5399,0xCC00, 0x5499,0x99FF, 0x5999,0x9900, 0x5a99,0x66FF, 0x5e99,0x6633, 0x5fA1,0x6600,0x6099,0x33FF, 0x6599,0x3300, 0x6699,0x00FF, 0x6b99,0x0000,0x6c66,0xFFFF, 0x7166,0xFF00, 0x7266,0xCCFF, 0x7766,0xCC00,0x7866,0x99FF, 0x7d66,0x9900, 0x7e66,0x66FF, 0x8366,0x6600,0x8466,0x33FF, 0x8966,0x3300, 0x8a66,0x00FF, 0x8f66,0x0000,0x9033,0xFFFF, 0x9533,0xFF00, 0x9633,0xCCFF, 0x9b33,0xCC00,0x9c33,0x99FF, 0xa133,0x9900, 0xa233,0x66FF, 0xa533,0x6666,0xa633,0x6e33, 0xa733,0x6600, 0xa833,0x33FF, 0xab33,0x3366,0xac33,0x333B, 0xad33,0x3300, 0xae33,0x00FF, 0xb333,0x0000,0xb400,0xFFCC, 0xb700,0xFF33, 0xb800,0xCCFF, 0xbd00,0xCC00,0xbe00,0x99FF, 0xc300,0x9900, 0xc400,0x66FF, 0xc900,0x6600, 0xca00,0x33FF, 0xcb00,0x33CC, 0xcc00,0x33A1, 0xcd00,0x3366,0xcf00,0x3300, 0xd000,0x00CC, 0xd300,0x0033,0xd4EE,0x0000, 0xd5DD,0x0000, 0xd6AA,0x0000, 0xd790,0x0000,0xd877,0x0000, 0xd955,0x0000, 0xda44,0x0000, 0xdb22,0x0000,0xdc11,0x0000, 0xdd00,0xEE00, 0xde00,0xDD00, 0xdf00,0xAA00,0xe000,0x8800, 0xe100,0x7700, 0xe200,0x5500, 0xe300,0x4400,0xe400,0x2200, 0xe500,0x1100, 0xe600,0x00EE, 0xe700,0x00DD,0xe800,0x00AA, 0xe900,0x0088, 0xea00,0x0077, 0xeb00,0x0055,0xec00,0x0044, 0xed00,0x0022, 0xee00,0x0011, 0xef22,0x2230,0xf0FF,0x9999, 0xf1FF,0xCCFF, 0xf299,0xD4FF, 0xf399,0xD499,0xf4FF,0xFF99, 0xf5F0,0xF0F0, 0xf6A4,0xC8F0, 0xf7C0,0xDCC0,0xf8C0,0xC0C0, 0xf900,0xBFBF, 0xfaBF,0x00BF, 0xfb00,0x00BF,0xfcBF,0xBF00, 0xfd00,0xBF00, 0xfeBF,0x0000, 0xff00,0x0000";
"Palu_142" = "0x00FF,0xFFFF, 0x0100,0xFFFF, 0x02FF,0x00FF, 0x0300,0x00FF,0x04FF,0xFF00, 0x0500,0xFF00, 0x06FF,0x0000, 0x0780,0x8080,0x08A0,0xA0A4, 0x09FF,0xFBF0, 0x0a33,0x3333, 0x0b99,0x6600,0x0c33,0x6633, 0x0d00,0x3399, 0x0eCC,0x00FF, 0x0f88,0x0000,0x10FF,0xCC66, 0x11FF,0x99CC, 0x12DD,0xDDDD, 0x13FF,0x9900,0x14FF,0x66FF, 0x19FF,0x6600, 0x1aFF,0x33FF, 0x1fFF,0x3300,0x20FF,0x00CC, 0x23FF,0x0033, 0x24CC,0xFFFF, 0x29CC,0xFF00,0x2aCC,0xCCFF, 0x2fCC,0xCC00, 0x30CC,0x99FF, 0x35CC,0x9900,0x36CC,0x66FF, 0x3bCC,0x6600, 0x3cCC,0x33FF, 0x41CC,0x3300,0x42D4,0x08FF, 0x43CC,0x00CC, 0x47CC,0x0000, 0x4899,0xFFFF,0x4d99,0xFF00, 0x4e99,0xCCFF, 0x5099,0xCC99, 0x5399,0xCC00,0x5499,0x99FF, 0x5999,0x9900, 0x5a99,0x66FF, 0x5e99,0x6633,0x5fA1,0x6600, 0x6099,0x33FF, 0x6599,0x3300, 0x6699,0x00FF,0x6b99,0x0000, 0x6c66,0xFFFF, 0x7166,0xFF00, 0x7266,0xCCFF,0x7766,0xCC00, 0x7866,0x99FF, 0x7d66,0x9900, 0x7e66,0x66FF,0x8366,0x6600, 0x8466,0x33FF, 0x8966,0x3300, 0x8a66,0x00FF,0x8f66,0x0000, 0x9033,0xFFFF, 0x9533,0xFF00, 0x9633,0xCCFF,0x9b33,0xCC00, 0x9c33,0x99FF, 0xa133,0x9900, 0xa233,0x66FF,0xa533,0x6666, 0xa633,0x6e33, 0xa733,0x6600, 0xa833,0x33FF,0xab33,0x3366, 0xac33,0x333B, 0xad33,0x3300, 0xae33,0x00FF, 0xb333,0x0000, 0xb400,0xFFCC, 0xb700,0xFF33, 0xb800,0xCCFF, 0xbd00,0xCC00, 0xbe00,0x99FF, 0xc300,0x9900, 0xc400,0x66FF,0xc900,0x6600, 0xca00,0x33FF, 0xcb00,0x33CC, 0xcc00,0x33A1,0xcd00,0x3366, 0xcf00,0x3300, 0xd000,0x00CC, 0xd300,0x0033,0xd4EE,0x0000, 0xd5DD,0x0000, 0xd6AA,0x0000, 0xd790,0x0000,0xd877,0x0000, 0xd955,0x0000, 0xda44,0x0000, 0xdb22,0x0000,0xdc11,0x0000, 0xdd00,0xEE00, 0xde00,0xDD00, 0xdf00,0xAA00,0xe000,0x8800, 0xe100,0x7700, 0xe200,0x5500, 0xe300,0x4400,0xe400,0x2200, 0xe500,0x1100, 0xe600,0x00EE, 0xe700,0x00DD,0xe800,0x00AA, 0xe900,0x0088, 0xea00,0x0077, 0xeb00,0x0055,0xec00,0x0044, 0xed00,0x0022, 0xee00,0x0011, 0xef22,0x2230,0xf0FF,0x9999, 0xf1FF,0xCCFF, 0xf299,0xD4FF, 0xf399,0xD499,0xf4FF,0xFF99, 0xf5F0,0xF0F0, 0xf6A6,0xCAF0, 0xf7C0,0xDCC0,0xf8C0,0xC0C0, 0xf900,0x8080, 0xfa80,0x0080, 0xfb00,0x0080,0xfc80,0x8000, 0xfd00,0x8000, 0xfe80,0x0000, 0xff00,0x0000";

//from mmp.r resource 'Pats' (10)
"Pats" = "0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xdd,0xff,0x77,0xff,0xdd,0xff,0x77,0xff,0xdd,0x77,0xdd,0x77,0xdd,0x77,0xdd,0x77,0xee,0xdd,0xbb,0x77,0xee,0xdd,0xbb,0x77,0xff,0xaa,0xff,0xaa,0xff,0xaa,0xff,0xaa,0xaa,0x55,0xaa,0x55,0xaa,0x55,0xaa,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x11,0x22,0x44,0x88,0x11,0x22,0x44,0x88,0xaa,0x00,0xaa,0x00,0xaa,0x00,0xaa,0x00,0x88,0x22,0x88,0x22,0x88,0x22,0x88,0x22,0x00,0x22,0x00,0x88,0x00,0x22,0x00,0x88,0x10,0x20,0x40,0x80,0x01,0x02,0x04,0x08,0x80,0x00,0x00,0x00,0x08,0x00,0x00,0x00,0x00,0x20,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x88,0x88,0x88,0x88,0x88,0x88,0x88,0x88,0x58,0xdf,0x00,0xdf,0xdf,0x58,0x58,0x58,0xb1,0x36,0x06,0x60,0x63,0x1b,0x18,0x81,0x08,0xff,0x01,0x01,0x01,0xff,0x08,0x08,0x00,0xff,0x00,0x00,0x00,0xff,0x00,0x00,0x80,0x80,0x80,0xff,0x80,0x80,0x80,0x80,0x80,0x10,0x02,0x40,0x04,0x20,0x09,0x00,0x80,0x01,0x82,0x44,0x38,0x10,0x20,0x40,0xff,0x00,0xff,0x00,0xff,0x00,0xff,0x00,0x22,0xff,0x22,0x22,0x22,0xff,0x22,0x22,0x00,0x08,0x14,0x2a,0x55,0x2a,0x14,0x08,0x81,0xaa,0x14,0x08,0x08,0xaa,0x41,0x80,0x3e,0x1d,0x88,0xd1,0xe3,0xc5,0x88,0x5c,0xaa,0x00,0x80,0x00,0x88,0x00,0x80,0x00,0x00,0x11,0x82,0x44,0x28,0x11,0x00,0x55,0x7c,0x10,0x10,0x28,0xc7,0x01,0x01,0x82,0xee,0x31,0xf1,0xf1,0xee,0x13,0x1f,0x1f,0x00,0x40,0x20,0x10,0x00,0x01,0x02,0x04,0x00,0x00,0x40,0xa0,0x00,0x04,0x0a,0x00,0x20,0x60,0x90,0x09,0x06,0x81,0x40,0x20,0x00,0x7f,0x43,0x5f,0x5f,0x5f,0x7f,0x7f,0x01,0x02,0x45,0xaa,0xff,0x20,0x40,0x80,0x00,0x44,0x0a,0x11,0x11,0x11,0x51,0x24,0x0f,0x0f,0x0f,0x0f,0xf0,0xf0,0xf0,0xf0,0xf8,0xfc,0xfa,0xfc,0xfa,0x54,0x2a,0x00,0x42,0xc3,0x3c,0x3c,0x3c,0x3c,0xc3,0x42,0x10,0x38,0x7c,0xfe,0x7d,0x3a,0x14,0x08,0x01,0x03,0x07,0x0f,0x1f,0x3f,0x7f,0xff,0xcc,0xcc,0xcc,0xcc,0xcc,0xcc,0xcc,0xcc,0xff,0xff,0x00,0x00,0xff,0xff,0x00,0x00,0xbb,0xdd,0xae,0x77,0xee,0xdd,0xab,0x77,0x80,0x40,0x40,0x20,0x20,0x18,0x06,0x01,0x01,0x82,0x44,0x28,0x10,0x28,0x44,0x82,0xc0,0xc0,0xc0,0xc0,0xc0,0xc0,0xff,0xff,0xe0,0xe0,0xe0,0xe0,0xe0,0xff,0xff,0xff,0x1f,0x1f,0x1f,0x1f,0x1f,0x00,0x00,0x00,0xc3,0x87,0x0f,0x1e,0x3c,0x78,0xf0,0xe1,0xf0,0xf0,0x0f,0x0f,0x0f,0xf0,0xf0,0xf0,0xff,0xff,0xe7,0xc3,0x81,0x18,0x3c,0x7e,0x1f,0x8f,0xc7,0xe3,0xc7,0x8f,0x1f,0x3e,0xff,0x2a,0xff,0xc8,0xff,0x65,0xff,0x9d";